In [22]:
#importing library
import sqlite3

In [23]:
connection = sqlite3.connect('users_management.db')

In [24]:
cursor = connection.cursor()

In [25]:
#creating table
user_table = """CREATE TABLE Users (
ID INT NOT NULL PRIMARY KEY,
FirstName VARCHAR(200) NOT NULL,
LastName VARCHAR(200) NOT NULL,
Age INT,
Salary INT NOT NULL,
Occupation VARCHAR(200),
Country VARCHAR(200),
YearJoined INT);"""

cursor.execute(user_table)

In [26]:
#inserting values to the table
users = """INSERT INTO Users VALUES
(01, 'Hisham', 'Ramadan', 22, 55000, 'Data Scientist', 'Canada', 2020),
(02, 'Samantha', 'Brocks', 35, 20000, 'Customer Representative', 'Canada', 2015),
(03, 'Sarah', 'Lavine', 30, 10000, 'Secretary', 'Sudan', 2017),
(04, 'Destiny', 'Indo', 35, 40000, 'Sales Agent', 'USA', 2015),
(05, 'Layla', 'Seter', 35, 2500000, 'CEO', 'Syria', 2018),
(06, 'Xin', 'Loki', 35, 280000, 'Chief Officer', 'China', 2020),
(07, 'Ahmed', 'Blag', 35, 200000, 'Chief Financial Officer', 'Egypt', 2010),
(08, 'James', 'Jonesi', 35, 10000, 'Call Agent', 'Singapore', 2011);
"""
cursor.execute(users)

In [27]:
#getting the data for the table created
cursor.execute("SELECT * FROM Users")

In [28]:
#viewing the table
view = cursor.fetchall()
print(view)

[(1, 'Hisham', 'Ramadan', 22, 55000, 'Data Scientist', 'Canada', 2020), (2, 'Samantha', 'Brocks', 35, 20000, 'Customer Representative', 'Canada', 2015), (3, 'Sarah', 'Lavine', 30, 10000, 'Secretary', 'Sudan', 2017), (4, 'Destiny', 'Indo', 35, 40000, 'Sales Agent', 'USA', 2015), (5, 'Layla', 'Seter', 35, 2500000, 'CEO', 'Syria', 2018), (6, 'Xin', 'Loki', 35, 280000, 'Chief Officer', 'China', 2020), (7, 'Ahmed', 'Blag', 35, 200000, 'Chief Financial Officer', 'Egypt', 2010), (8, 'James', 'Jonesi', 35, 10000, 'Call Agent', 'Singapore', 2011)]

In [29]:
#viewing employees from Canada
canadians = """SELECT * FROM Users
WHERE Country='Canada';"""
cursor.execute(canadians)
view_canadians=cursor.fetchall()
print(view_canadians)

[(1, 'Hisham', 'Ramadan', 22, 55000, 'Data Scientist', 'Canada', 2020), (2, 'Samantha', 'Brocks', 35, 20000, 'Customer Representative', 'Canada', 2015)]

In [30]:
#viewing employees with the same age and make 100000 and over
cursor.execute("""SELECT * FROM Users
WHERE Age=35
AND Salary >= 100000;""")
age_salary = cursor.fetchall()
print(age_salary)

[(5, 'Layla', 'Seter', 35, 2500000, 'CEO', 'Syria', 2018), (6, 'Xin', 'Loki', 35, 280000, 'Chief Officer', 'China', 2020), (7, 'Ahmed', 'Blag', 35, 200000, 'Chief Financial Officer', 'Egypt', 2010)]

In [31]:
#employee with highest salary
cursor.execute("""SELECT * FROM Users
WHERE SALARY IN
(SELECT Max(Salary) FROM Users);""")
highest_salary = cursor.fetchall()
print(highest_salary)

[(5, 'Layla', 'Seter', 35, 2500000, 'CEO', 'Syria', 2018)]

In [32]:
#employee with lowest salary
cursor.execute("""SELECT * FROM Users
WHERE SALARY IN
(SELECT Min(Salary) FROM Users);
""")
lowest_salary = cursor.fetchall()
print(lowest_salary)

[(3, 'Sarah', 'Lavine', 30, 10000, 'Secretary', 'Sudan', 2017), (8, 'James', 'Jonesi', 35, 10000, 'Call Agent', 'Singapore', 2011)]

In [33]:
#new sales table
sales_table = """CREATE TABLE Sales (
ID INT NOT NULL PRIMARY KEY,
Sales INT);"""

cursor.execute(sales_table)

In [34]:
#insering values into the sales table
sales = """INSERT INTO Sales VALUES
(01, 500),
(02, 2000),
(04, 50),
(08, 10000);
"""
cursor.execute(sales)

In [35]:
#joining firstname, salary, country from users with sales from sales

cursor.execute("""SELECT Users.FirstName, Users.Salary, Users.Country, Sales.Sales
FROM Users
JOIN Sales ON Users.ID=Sales.ID;""")

both_tables=cursor.fetchall()
print(both_tables)

[('Hisham', 55000, 'Canada', 500), ('Samantha', 20000, 'Canada', 2000), ('Destiny', 40000, 'USA', 50), ('James', 10000, 'Singapore', 10000)]

In [36]:
connection.commit()

In [37]:
connection.close()